<script>
    export let title = "Образование";
</script>

<div class="max-w-5xl mx-auto py-8 px-4">
    <div class="bg-white shadow-lg rounded-lg p-6">
        <article class="prose text-gray-800">
            <h1>{title}</h1>

            <h2>Базовое Образование</h2>
            <ul class="list-disc ml-6">
                <li>
                    <b>Московский Институт Психоанализа, Магистратура, Консультативная психология</b>
                </li>
                <li>
                    <b>МГУ имени М.В.Ломоносова профессиональная переподготовка по программе «Когнитивно-поведенческая психотерапия»</b>
                </li>
                <li>
                    <b>Институт психотерапии и медицинской психологии им. Б.Д. Карвасарского клиническая (медицинская) психология</b>
                </li>
                <li>
                    <b>АНО ДПО «Международная академия сексологии» профессиональная переподготовка по программе «Основы сексологии в психологическом консультировании»</b>
                </li>
                <li>
                    <b>EMDR Institute</b>
                </li>
            </ul>
            </article>
    </div>
    </div>

<div class="max-w-5xl mx-auto py-8 px-4">
    <div class="bg-white shadow-lg rounded-lg p-6">
        <article class="prose text-gray-800">
            <h2>Дополнительное Образование</h2>
            <ul class="list-disc ml-6">
                <li><b>EMDR Institute, Basic Training</b> Уди Орен</li>
                <li><b>EMDR 2.0</b>, Ad deJongh, Phd и Suzy Matthijssen, Phd</li>
                <li><b>IFS Institute, Level 1</b> Richard Schwartz</li>
                <li><b>Диалектико-поведенческая психотерапия комплексного ПТСР</b> Martin Bohus</li>
                <li><b>IFS терапия внутренних семейных систем, Марина Хазан, Юлия Варлакова.</b></li>
                <li><b>Доказательная психотерапия расстройств пищевого поведения</b>, Ирина Ушкова</li>
                <li><b>Системная сексуальная психотерапия</b>, Марина Травкова</li>
                <li><b>Интегративная терапия сексуальных дисфункций у женщин, международная академия сексологии</b></li>
                <li><b>Сексологические запросы в работе EMDR-терапевта</b></li>
                <li><b>ACT</b> – Терапия принятия и ответственности базовый курс</li>
                <li><b>CFT basic</b>, Dr. Tatyana Reinhardt</li>
                <li><b>IFS Russia</b>, сертификат</li>
                <li><b>IFS “Терапия внутренних семейных систем”</b> Psychodemia</li>
                <li><b>ОПКТ</b> – Ориентированная на решение краткосрочная терапия и EMDR</li>
                <li>
                    <b>КПТ</b> – Теория и практика когнитивно-поведенческого подхода в решении эмоциональных проблем и преодолении неприятных переживаний (удостоверение о повышении
                    квалификации)
                </li>
                <li>
                    <b>КПТ</b> – Когнитивно-поведенческая психотерапия в работе с пациентом с личностным расстройством и психосоматическим заболеванием
                </li>
                <li>
                    <b>«Современные подходы к психотерапии расстройств пищевого поведения»</b>, ИПМП им. Б.Д. Карвасарского
                </li>
                <li>
                    <b>«Современные подходы к психотерапии кризисных состояний, невротических расстройств и психосоматических заболеваний»</b>, ИПМП им. Б.Д. Карвасарского
                </li>
                <li>
                    <b>«Личностно-ориентированная (реконструктивная) психотерапия в лечении невротических расстройств, пограничных состояний и зависимостей»</b>, ИПМП им. Б.Д.
                    Карвасарского
                </li>
                <li>
                    <b>«Десенсибилизация и переработка движениями глаз»</b> Доморацкий В.А. Европейская ассоциация психотерапии
                </li>
                <li>
                    <b>«Работа с сексуальной проблематикой в психотерапии и психологическом консультировании»</b> Доморацкий В.А. Европейская ассоциация психотерапии
                </li>
            </ul>
            </article>
    </div>
</div>
<div class="max-w-5xl mx-auto py-8 px-4">
    <div class="bg-white shadow-lg rounded-lg p-6">
        <article class="prose text-gray-800">
            <h2>Опыт</h2>
            <ul class="list-disc ml-6">
                <li>Веду частную практику с 2020 года, более 1500 часов проведенных консультаций</li>
                <li>Регулярно прохожу супервизии и личную терапию</li>
                <li>В настоящее время продолжаю повышать квалификацию</li>
            </ul>
        </article>
    </div>
</div>
