<script>
    const methods = [
        {
            title: 'EMDR',
            description: `EMDR (Eye Movement Desensitization and Reprocessing) – с английского переводится как ДПДГ (Десенсибилизация и переработка движением глаз). EMDR — уникальный метод психотерапии, имеющий доказанную эффективность и помогающий справиться с последствиями перенесенных психологических травм. Особенность этого метода терапии состоит в том, что EMDR позволяет клиенту перерабатывать любой эмоциональный опыт, даже тот о котором он не в состоянии говорить. В 2013 году Всемирная Организация Здравоохранения официально рекомендовала EMDR как наиболее эффективную терапию для работы с посттравматическим стрессовым расстройством.`,
        },
        {
            title: 'IFS',
            description: `IFS (Internal Family Systems) - Cистемная семейная терапия субличностей или внутренние семейные системы – новейший интегративный подход в психотерапии, объединяющий в себе системную логику, концепт множественности личности, работу с травмой и работу с телом. Создан более 20 лет назад Ричардом Шварцем (США), работает с широким спектром проблем, обладает доказательной базой.`,
        },
        {
            title: 'CBT или КПТ',
            description: `CBT (cognitive behavioral therapy) или КПТ(когнитивно-поведенческая психотерапия) имеет доказанную эффективность при различных психических расстройствах и представляет собой сфокусированное на навыках лечение, направленное на изменение дезадаптивных эмоциональных реакций при помощи изменения мыслей, изменения поведения клиента, либо изменения того и другого. КПТ является терапией выбора при многих психических расстройствах.`,
        },
        {
            title: 'Flash',
            description: `Техника Flash, разработана Филиппом Мэнфилдом как часть фазы подготовки для работы в EMDR, эффективна в снижении уровня беспокойства, связанного с сильно болезненными воспоминаниями.`,
        },
        {
            title: 'DBT',
            description: `DBT (dialectical behavior therapy) - Диалектико-поведенческая терапия-полная сострадания и обладающая доказанной эффективностью модель помощи. DBT сочетает базовые стратегии поведенческой терапии с практиками осознанности (mindfulness).`,
        },
        {
            title: 'ACT или Терапия принятия и ответственности',
            description: `ACT (acceptance and commitment therapy) или Терапия принятия и ответственности-направление психотерапии третьей волны когнитивно-поведенческого подхода. Основная задача не избавление от тяжелых переживаний, а скорее научение не слишком реагировать на них.`,
        },
        {
            title: 'CFT',
            description: `CFT (Compassion-focused therapy) - Терапия ориентированная на сострадание — это вид психотерапии, предназначенный для помощи тем, кто страдает от высокого уровня самокритики и стыда.`,
        },
        {
            title: 'SFBT',
            description: `SFBT (Solution-focused brief therapy) - ОРКТ, Ориентированная на решение краткосрочная терапия. Этот вид терапии является эффективным, полезным, и дающим надежду на изменения, независимо от степени трудностей или выраженности проблем.`,
        },
    ];
</script>

<style>
    .card {
        transition: transform 0.3s ease, box-shadow 0.3s ease;
    }

    .card:hover {
        transform: scale(1.05);
        box-shadow: 0 8px 15px rgba(0, 0, 0, 0.2);
    }
</style>

<div class="max-w-5xl mx-auto py-8 px-4">
    <h1 class="text-3xl font-bold mb-8 text-center text-gray-800">Мои Методы</h1>
    <div class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-6">
        {#each methods as { title, description }}
            <div class="card bg-white shadow-lg rounded-lg p-6">
                <h2 class="text-xl font-bold mb-4 text-[#DDC8C4]">{title}</h2>
                <p class="text-gray-700 text-sm">{description}</p>
            </div>
        {/each}
    </div>
</div>